// ignore_for_file: dead_code, prefer_const_constructors, library_private_types_in_public_api

import 'package:flutter/material.dart';
import 'package:flutter_widget_from_html/flutter_widget_from_html.dart';

class IndexPage extends StatefulWidget {
  const IndexPage({Key? key}) : super(key: key);

  @override
  _IndexPageState createState() => _IndexPageState();
}

class _IndexPageState extends State<IndexPage> {
  var htmlData = r"""<html>

<body>

    <h3 style="text-align: center;">உங்களோடு...</h3>

        <p><b>ஆண்டவரும், அன்பு இரட்சகருமான இயேசு கிறிஸ்துவின் நாமத்தில் யூதாவாகிய (துதி) உங்களுக்கு வாழ்த்துக்கள்! </b>
        </p>
        <p>தேவனுடைய கிருபையால்
            <b>‘துதிபலிகள்</b>என்ற புத்தகத்தை வெளியிட்டுள்ளோம்! தேவனுக்கு மகிமை உண்டாகட்டும்!
        </p>

        <p>ஆராய்ந்து முடியாத பெரிய காரியங்களையும்,எண்ணி முடியாத அதிசயங்களையும் செய்கிற நம் தேவனுக்கு உதடுகளின்
            கனியாகிய ஸ்தோத்திரபலியை செலுத்தும் போது சர்வ வல்லமையுள்ளவரின் நாமம் மகிமைப்படுகிறது.
            <b>“ஸ்தோத்திரபலியிடுகிறவன் என்னை மகிமைப்படுத்துகிறான்” (சங் 50:23)</b> என்று கர்த்தர் சொல்லுகிறார்.
        </p>
        <p><b>"என் வாய் உமது துதியினாலும், நாள்தோறும் உமது மகத்துவத்தினாலும் நிறைந்திருப்பதாக'' (சங் 71:8)</b>என்று
            சொன்ன தாவீதை
            <b>'என் இருதயத்துக்கு ஏற்றவன்'</b>என்றும், தேவனை இடைவிடாமல் ஆராதனை செய்து வந்த தானியேலை <b>'மிகவும்
                பிரியமானவன்'</b>
            என்றும் தேவனே சாட்சி கூறுகிறார்.
        </p>
        <p><b>ஆம்! துதிப்பவர்கள்...</b></p>
        <p>* தேவனுக்குப் பிரியமானவர்கள்!<br>
            * தேவனுடைய இருதயத்துக்கு ஏற்றவர்கள்!<br>
            * தேவனுக்கு மகிமையைச் செலுத்துபவர்கள்!</p>
        <p> அதுமட்டுமல்ல, <b>'துதியினாலே'</b> அடைக்கப்பட்டிருந்த எரிகோ பட்டணத்தின் மதில்கள் ஏழுநாள் சுற்றி வரப்பட்டு
            விழுந்தது (யோசு 6:24)
            என்று வேதத்தில் வாசிக்கிறோம்!</p>
        <p><b>ஆம்! துதிப்பதினால்...</b></p>
        <p>* எரிகோ போன்ற தடைகள் மாறும்!<br>
            * சுவிசேஷ வாசல்கள் திறக்கப்படும்!<br>
            * விக்கிரகக் கோட்டைகள் நொறுங்கிவிழும்!<br></p>
        <p>தேவனுக்கு மகிமையையும், துதியையும் செலுத்துவது அவருக்குப் பிரியமாயிருக்கிறது.
            நாம் துதிபலிகளை ஏறெடுக்கும் பொழுது தேவ மகிமை நம்மேல் அளவில்லாமல் இறங்கிவருகிறது. தேவன் மகிமையான காரியங்களைச்
            செய்கிறார்.
            இப்புத்தகத்தில் தேசத்தைக் குறித்த, தேவ நீதியையும்,
            நியாயத்தீர்ப்பையும் குறித்த துதி ஸ்தோத்திரங்களை தொகுத்து வெளியிட்டுள்ளோம்!
            இப்புத்தகத்திலுள்ள துதி ஸ்தோத்திரங்களை ஒவ்வொரு நாளும் ஏறெடுப்போம்! நம் வாழ்க்கையிலும்,
            தேசத்திலும் காணப்படுகின்ற தடைகள் மாறும்!! இயேசுவின் நாமத்தில் ஜெயம் பெறுவோம்!!!</p>

        <p><b>இந்த ஜனத்தை எனக்கென்று ஏற்படுத்தினேன்; இவர்கள் என் துதியைச் சொல்லிவருவார்கள்'' (ஏசா 43:21)</b></p>
        <p>
</body>

</html>""";
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text("முன்னுரை"),
      ),
      body: Padding(
        padding: const EdgeInsets.all(10.0),
        child: SingleChildScrollView(
          child: HtmlWidget(htmlData),
        ),
      ),
    );
  }
}
